{"stop": 1, "in": 2, "a": 3, "python": 4, "to": 5, "'": 6, "how": 7, "1": 8, "0": 9, "for": 10, "of": 11, "with": 12, "i": 13, "from": 14, "x": 15, "list": 16, "self": 17, "2": 18, "the": 19, "def": 20, "print": 21, "pass": 22, "import": 23, "if": 24, "return": 25, "data": 26, "s": 27, "np": 28, "and": 29, "file": 30, "3": 31, "get": 32, "using": 33, "string": 34, "array": 35, "is": 36, "name": 37, "df": 38, "numpy": 39, "as": 40, "b": 41, "class": 42, "django": 43, "y": 44, "value": 45, "set": 46, "5": 47, "do": 48, "n": 49, "f": 50, "4": 51, "pandas": 52, "key": 53, "c": 54, "on": 55, "an": 56, "can": 57, "d": 58, "values": 59, "range": 60, "line": 61, "text": 62, "true": 63, "all": 64, "path": 65, "index": 66, "plt": 67, "function": 68, "add": 69, "matplotlib": 70, "len": 71, "open": 72, "request": 73, "find": 74, "time": 75, "10": 76, "os": 77, "none": 78, "dataframe": 79, "datetime": 80, "way": 81, "object": 82, "dict": 83, "by": 84, "into": 85, "random": 86, "t": 87, "not": 88, "multiple": 89, "read": 90, "p": 91, "dictionary": 92, "use": 93, "plot": 94, "two": 95, "k": 96, "image": 97, "append": 98, "split": 99, "args": 100, "row": 101, "that": 102, "item": 103, "column": 104, "url": 105, "create": 106, "or": 107, "sys": 108, "number": 109, "r": 110, "format": 111, "m": 112, "app": 113, "user": 114, "result": 115, "str": 116, "ax": 117, "json": 118, "re": 119, "6": 120, "my": 121, "convert": 122, "write": 123, "init": 124, "it": 125, "l": 126, "join": 127, "pd": 128, "'a'": 129, "one": 130, "date": 131, "new": 132, "test": 133, "columns": 134, "id": 135, "items": 136, "int": 137, "model": 138, "files": 139, "variable": 140, "v": 141, "csv": 142, "lambda": 143, "size": 144, "false": 145, "''": 146, "8": 147, "foo": 148, "output": 149, "without": 150, "module": 151, "lists": 152, "start": 153, "show": 154, "make": 155, "count": 156, "type": 157, "7": 158, "input": 159, "element": 160, "sum": 161, "'b'": 162, "while": 163, "kwargs": 164, "parse": 165, "elements": 166, "response": 167, "main": 168, "method": 169, "max": 170, "table": 171, "run": 172, "axis": 173, "models": 174, "objects": 175, "keys": 176, "html": 177, "remove": 178, "flask": 179, "map": 180, "loop": 181, "group": 182, "check": 183, "matrix": 184, "root": 185, "strings": 186, "filename": 187, "stdout": 188, "there": 189, "j": 190, "color": 191, "out": 192, "word": 193, "100": 194, "zip": 195, "replace": 196, "z": 197, "subprocess": 198, "close": 199, "logging": 200, "code": 201, "9": 202, "db": 203, "save": 204, "process": 205, "g": 206, "else": 207, "script": 208, "rows": 209, "shape": 210, "match": 211, "w": 212, "when": 213, "sort": 214, "regex": 215, "filter": 216, "you": 217, "order": 218, "default": 219, "length": 220, "first": 221, "at": 222, "sqlalchemy": 223, "obj": 224, "bar": 225, "urllib": 226, "between": 227, "lines": 228, "numbers": 229, "field": 230, "fig": 231, "same": 232, "another": 233, "e": 234, "change": 235, "query": 236, "only": 237, "parser": 238, "custom": 239, "'c'": 240, "based": 241, "xml": 242, "variables": 243, "are": 244, "each": 245, "n'": 246, "other": 247, "arrays": 248, "float": 249, "some": 250, "window": 251, "tuple": 252, "search": 253, "specific": 254, "this": 255, "s'": 256, "client": 257, "end": 258, "any": 259, "scipy": 260, "form": 261, "google": 262, "post": 263, "label": 264, "requests": 265, "sub": 266, "update": 267, "words": 268, "call": 269, "func": 270, "access": 271, "command": 272, "server": 273, "log": 274, "be": 275, "groupby": 276, "frame": 277, "integer": 278, "template": 279, "within": 280, "session": 281, "names": 282, "20": 283, "num": 284, "content": 285, "instance": 286, "send": 287, "non": 288, "sorted": 289, "library": 290, "'http": 291, "socket": 292, "different": 293, "what": 294, "creating": 295, "next": 296, "given": 297, "page": 298, "tkinter": 299, "txt'": 300, "engine": 301, "fields": 302, "current": 303, "getting": 304, "arguments": 305, "select": 306, "h": 307, "tree": 308, "unicode": 309, "after": 310, "dtype": 311, "last": 312, "api": 313, "base": 314, "yield": 315, "itertools": 316, "where": 317, "message": 318, "nested": 319, "12": 320, "series": 321, "http": 322, "arange": 323, "finding": 324, "over": 325, "characters": 326, "load": 327, "beautifulsoup": 328, "col": 329, "generate": 330, "argument": 331, "extract": 332, "windows": 333, "application": 334, "single": 335, "apply": 336, "results": 337, "insert": 338, "img": 339, "context": 340, "points": 341, "possible": 342, "node": 343, "ctypes": 344, "val": 345, "many": 346, "execute": 347, "unique": 348, "display": 349, "width": 350}