{"weightsManifest": [{"paths": ["group1-shard1of2.bin", "group1-shard2of2.bin"], "weights": [{"dtype": "float32", "shape": [256, 300], "name": "dense_3/kernel"}, {"dtype": "float32", "shape": [300], "name": "dense_3/bias"}, {"dtype": "float32", "shape": [300, 1], "name": "dense_4/kernel"}, {"dtype": "float32", "shape": [1], "name": "dense_4/bias"}, {"dtype": "float32", "shape": [350, 250], "name": "embedding_2/embeddings"}, {"dtype": "float32", "shape": [250, 1024], "name": "lstm_3/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_3/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "lstm_3/bias"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_4/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "lstm_4/recurrent_kernel"}, {"dtype": "float32", "shape": [1024], "name": "lstm_4/bias"}]}], "modelTopology": {"training_config": {"metrics": ["mae", "mse"], "loss": "mean_absolute_error", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "lr": 0.0010000000474974513}}, "loss_weights": null, "sample_weight_mode": null}, "keras_version": "2.2.4", "model_config": {"class_name": "Sequential", "config": {"layers": [{"class_name": "Embedding", "config": {"embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "embedding_2", "dtype": "float32", "output_dim": 250, "trainable": true, "embeddings_regularizer": null, "input_dim": 350, "mask_zero": false, "embeddings_constraint": null, "batch_input_shape": [null, 125], "activity_regularizer": null, "input_length": 125}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_3"}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.2, "recurrent_regularizer": null, "name": "lstm_3", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"recurrent_activation": "hard_sigmoid", "trainable": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_regularizer": null, "return_state": false, "unroll": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "unit_forget_bias": true, "activity_regularizer": null, "recurrent_dropout": 0.2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "activation": "tanh", "stateful": false, "dropout": 0.2, "recurrent_regularizer": null, "name": "lstm_4", "bias_constraint": null, "go_backwards": false, "implementation": 1, "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 300, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "trainable": true, "seed": null, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_4", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}], "name": "sequential_2"}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.2.6", "format": "layers-model"}